# Ввод трех целых чисел с клавиатуры
num1 = int(input("Введите первое целое число: "))
num2 = int(input("Введите второе целое число: "))
num3 = int(input("Введите третье целое число: "))

# Нахождение суммы
сумма = num1 + num2 + num3

# Нахождение произведения
произведение = num1 * num2 * num3

# Нахождение среднего арифметического
среднее = (num1 + num2 + num3) / 3

# Вывод результатов
print("Сумма:", сумма)
print("Произведение:", произведение)
print("Среднее арифметическое:", среднее)
