# Запрос имени пользователя
name = input("Как Вас зовут? ")

# Приветствие с использованием имени
print(f"Добрый день, {name}!")

# Запрос названия техникума
school_name = input("Укажите название техникума: ")

# Запрос номера группы
group_number = input("Укажите номер вашей группы: ")

# Вывод информации о техникуме и группе
print(f"Вы обучаетесь в образовательной организации {school_name} в группе {group_number}")

# Запрос языка программирования
programming_language = input("Какой язык программирования вы начинаете изучать? ")

# Пожелание успешного обучения
print(f"{name}, желаем Вам успешного обучения программированию на языке {programming_language}")
