import random
import math

# Цикл для генерации 10 случайных чисел
for _ in range(10):
    num = random.randint(-10, 10)  # Генерация случайного числа от -10 до 10

    # Проверка условий
    if num < 0:
        continue  # Пропустить отрицательные числа и перейти к следующей итерации
    elif num == 0:
        break  # Прервать цикл, если число равно нулю

    # Вычисление и вывод квадратного корня положительного числа
    square_root = math.sqrt(num)
    print(f"Квадратный корень числа {num} равен {square_root}")
